# -*- coding: utf-8 -*-

def parseText(text):
    allowedChars = list(' qwertyuiopasdfghjklzxcvbnmйцукенгшщзхъфывапролджэячсмитьбюёїіє')
    parsedText = ''
    for char in list(text):
        if char in allowedChars:
            parsedText += char
    return parsedText

def sortDict(dict):
    sortedKeys = sorted(dict, key=dict.get, reverse=True)
    sortedDict = {}
    for key in sortedKeys:
        sortedDict[key] = dict[key]
    return sortedDict

emotions = {
    'радість': ('ура','нарешті','дякую','перемога','нащастя','радістю','звісно','люблю','радісно'),
    'подив': ('ого','нічого собі','диво','ух-ти','воу','капець','здивувався','здивований'),
    'горе': ('на жаль','розчарований','горе','гаплик','ех','печаль','горе','капець')
}

text = input('Введіть будь-який текст (залиште порожнім для тексту за замовчуванням) >> ')

if text == '':
    text = '''До неї було якихось десять кроків... це була крамничка з газетами і канцтоварами, в якій продавалося все, що завгодно, навіть цукерки та сигари... І ось що він зробить, зашепотів Чарлі гарячково сам до себе... він купить один запашний солодкий батончик і з'їсть його увесь, до крихти, просто отут, просто зараз... а решту грошей віднесе додому і віддасть мамі.
    Розділ 11. Чудо
    Чарлі зайшов до крамнички й поклав на прилавок мокру доларову банкноту.
    — Один "Високочудесний зефірмелад Вон-ки", — випалив він, - перемога, пригадуючи смак батончика, подарованого на день народження.
    Чоловік за прилавком був жирний і вгодований. Мав великі губи, гладкі щоки й товстелезну шию. Жир навколо шиї звисав складками на комір, немов гумовий обруч. Він відвернувся, сягнув рукою, тоді знову повернувся до Чарлі і дав йому батончик. Чарлі схопив шоколадку, миттю зірвав обгортку і вп'явся в неї зубами. Відкусив великий шматок... тоді другий... о, яка ж то радість запихати в рот величезні кусні чогось солодкого й твердого! Яке неймовірне блаженство відчувати в роті тверду й поживну їжу!
    — Синку, ти так сильно захотів батончика? — лагідно спитав продавець.
    Чарлі кивнув, а рота йому аж розпирало шоколадом. Печаль наповнювала його погляд. Продавець поклав на прилавок здачу.
    — їж потроху, — порадив він. — Живіт заболить, якщо ковтати не прожувавши. Горе мені горе!
    Чарлі й далі пожадливо ковтав. Не міг зупинитися. Не минуло й півхвилини, як батончик зник у горлі. Хлопець ледве дихав, але відчував неймовірне, величезне щастя. Простяг руку по здачу. Тоді завагався. Його очі були на одному [68] рівні з прилавком. Дивилися на маленькі срібні монетки, що там лежали. Усі десяти-центові. Дев'ять штук. Яка різниця, якщо він витратить ще однісіньку...
    — Мабуть, — сказав він тихо, — мабуть... я візьму ще один батончик. Такий самий, якщо можна.
    — Чому ж не можна? — відповів гладкий продавець. Він знову сягнув собі за спину й дістав з полиці ще один "Високочудесний зефірме-лад Вонки". Поклав його на прилавок.
    Чарлі взяв, здер обгортку... і раптом... з-під обгортки... блиснуло золотим сяйвом. Серце в нього завмерло.'''

text = text.lower()
text = parseText(text)
splitText = text.split(' ')
emotionsCount = {}

for emotion in emotions:
    emotionsCount[emotion] = 0

for word in splitText:
    for emotion in emotions:
        if word in emotions[emotion]:
            emotionsCount[emotion] += 1

emotionsCount = sortDict(emotionsCount)

print('\nКількість емоцій')
for emotion in emotionsCount:
    print(' - ' + emotion + ': ' + str(emotionsCount[emotion]))

print('\nНайповторюваніша емоція:', list(emotionsCount.keys())[0])
